# EdgeObject Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
IntersectionResult..::..EdgeObject Property
IntersectionResult Class See Also
---
Edge of the face close to the point of intersection.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public Edge EdgeObject { get; internal set; }
```

Visual Basic
---
```text
Public Property EdgeObject As Edge
	Get
	Friend Set
```

Visual C++
---
```text
public:
property Edge^ EdgeObject {
	Edge^ get ();
	internal: void set (Edge^ value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | Thrown in the getter when this property has not been set by the method providing the result. |

# See Also
IntersectionResult Class
Autodesk.Revit.DB Namespace